import React, { useState } from 'react';
import Accordion from './Accordion';

const Curriculum = () => {


    const data = [
        {
            id: 1,
            moduleName: 'কমপ্লিট ফ্রন্ট-এন্ড ডেভেলপমেন্ট শিখুন 1 ',
            lessons: [
                'কমপ্লিট ফ্রন্ট-এন্ড ডেভেলপমেন্ট শিখুন - 1',
                'কমপ্লিট ফ্রন্ট-এন্ড ডেভেলপমেন্ট শিখুন - 2',
                'কমপ্লিট ফ্রন্ট-এন্ড ডেভেলপমেন্ট শিখুন - 3',
                'কমপ্লিট ফ্রন্ট-এন্ড ডেভেলপমেন্ট শিখুন - 4',
            ]

        },
        {
            id: 2,
            moduleName: 'কমপ্লিট ফ্রন্ট-এন্ড ডেভেলপমেন্ট শিখুন 2',
            lessons: [
                'কমপ্লিট ফ্রন্ট-এন্ড ডেভেলপমেন্ট শিখুন - 1',
                'কমপ্লিট ফ্রন্ট-এন্ড ডেভেলপমেন্ট শিখুন - 2',
                'কমপ্লিট ফ্রন্ট-এন্ড ডেভেলপমেন্ট শিখুন - 3',
                'কমপ্লিট ফ্রন্ট-এন্ড ডেভেলপমেন্ট শিখুন - 4',
                'কমপ্লিট ফ্রন্ট-এন্ড ডেভেলপমেন্ট শিখুন - 5',
                'কমপ্লিট ফ্রন্ট-এন্ড ডেভেলপমেন্ট শিখুন - 6',
            ]

        },
        {
            id: 3,
            moduleName: 'কমপ্লিট ফ্রন্ট-এন্ড ডেভেলপমেন্ট শিখুন 3',
            lessons: [
                'কমপ্লিট ফ্রন্ট-এন্ড ডেভেলপমেন্ট শিখুন - 1',
                'কমপ্লিট ফ্রন্ট-এন্ড ডেভেলপমেন্ট শিখুন - 2',
                'কমপ্লিট ফ্রন্ট-এন্ড ডেভেলপমেন্ট শিখুন - 3',
                'কমপ্লিট ফ্রন্ট-এন্ড ডেভেলপমেন্ট শিখুন - 4',
                'কমপ্লিট ফ্রন্ট-এন্ড ডেভেলপমেন্ট শিখুন - 5',
                'কমপ্লিট ফ্রন্ট-এন্ড ডেভেলপমেন্ট শিখুন - 6',
            ]

        },
        {
            id: 4,
            moduleName: 'কমপ্লিট ফ্রন্ট-এন্ড ডেভেলপমেন্ট শিখুন 4',
            lessons: [
                'কমপ্লিট ফ্রন্ট-এন্ড ডেভেলপমেন্ট শিখুন - 1',
                'কমপ্লিট ফ্রন্ট-এন্ড ডেভেলপমেন্ট শিখুন - 2',
                'কমপ্লিট ফ্রন্ট-এন্ড ডেভেলপমেন্ট শিখুন - 3',
                'কমপ্লিট ফ্রন্ট-এন্ড ডেভেলপমেন্ট শিখুন - 4',
                'কমপ্লিট ফ্রন্ট-এন্ড ডেভেলপমেন্ট শিখুন - 5',
                'কমপ্লিট ফ্রন্ট-এন্ড ডেভেলপমেন্ট শিখুন - 6',
            ]

        }
    ]


    return (
        <div className='p-2 h-[80vh] overflow-y-scroll homecatagory '>
            {
                data.map((d) => {
                    const { id, moduleName, lessons } = d;
                    return <Accordion key={id} {...d} ></Accordion>
                })
            }
        </div>



    );
};

export default Curriculum;