import React, { useState } from 'react';
import Accordion from './Accordion';

const Curriculum = () => {
    const [expand, setExpand] = useState(false)

    const data = [
        {
            id: 1,
            moduleName: 'কমপ্লিট ফ্রন্ট-এন্ড ডেভেলপমেন্ট শিখুন 1 ',
            lessons: [
                'কমপ্লিট ফ্রন্ট-এন্ড ডেভেলপমেন্ট শিখুন - 1',
                'কমপ্লিট ফ্রন্ট-এন্ড ডেভেলপমেন্ট শিখুন - 2',
                'কমপ্লিট ফ্রন্ট-এন্ড ডেভেলপমেন্ট শিখুন - 3',
                'কমপ্লিট ফ্রন্ট-এন্ড ডেভেলপমেন্ট শিখুন - 4',
            ]

        },
        {
            id: 2,
            moduleName: 'কমপ্লিট ফ্রন্ট-এন্ড ডেভেলপমেন্ট শিখুন 2',
            lessons: [
                'কমপ্লিট ফ্রন্ট-এন্ড ডেভেলপমেন্ট শিখুন - 1',
                'কমপ্লিট ফ্রন্ট-এন্ড ডেভেলপমেন্ট শিখুন - 2',
                'কমপ্লিট ফ্রন্ট-এন্ড ডেভেলপমেন্ট শিখুন - 3',
                'কমপ্লিট ফ্রন্ট-এন্ড ডেভেলপমেন্ট শিখুন - 4',
                'কমপ্লিট ফ্রন্ট-এন্ড ডেভেলপমেন্ট শিখুন - 5',
                'কমপ্লিট ফ্রন্ট-এন্ড ডেভেলপমেন্ট শিখুন - 6',
            ]

        },
        {
            id: 3,
            moduleName: 'কমপ্লিট ফ্রন্ট-এন্ড ডেভেলপমেন্ট শিখুন 3',
            lessons: [
                'কমপ্লিট ফ্রন্ট-এন্ড ডেভেলপমেন্ট শিখুন - 1',
                'কমপ্লিট ফ্রন্ট-এন্ড ডেভেলপমেন্ট শিখুন - 2',
                'কমপ্লিট ফ্রন্ট-এন্ড ডেভেলপমেন্ট শিখুন - 3',
                'কমপ্লিট ফ্রন্ট-এন্ড ডেভেলপমেন্ট শিখুন - 4',
                'কমপ্লিট ফ্রন্ট-এন্ড ডেভেলপমেন্ট শিখুন - 5',
                'কমপ্লিট ফ্রন্ট-এন্ড ডেভেলপমেন্ট শিখুন - 6',
            ]

        },
        {
            id: 4,
            moduleName: 'কমপ্লিট ফ্রন্ট-এন্ড ডেভেলপমেন্ট শিখুন 4',
            lessons: [
                'কমপ্লিট ফ্রন্ট-এন্ড ডেভেলপমেন্ট শিখুন - 1',
                'কমপ্লিট ফ্রন্ট-এন্ড ডেভেলপমেন্ট শিখুন - 2',
                'কমপ্লিট ফ্রন্ট-এন্ড ডেভেলপমেন্ট শিখুন - 3',
                'কমপ্লিট ফ্রন্ট-এন্ড ডেভেলপমেন্ট শিখুন - 4',
                'কমপ্লিট ফ্রন্ট-এন্ড ডেভেলপমেন্ট শিখুন - 5',
                'কমপ্লিট ফ্রন্ট-এন্ড ডেভেলপমেন্ট শিখুন - 6',
            ]

        }
    ]


    return (
        <div className='p-2 h-[80vh] overflow-y-scroll homecatagory '>
            <div className='flex justify-between items-center my-3'>

                <h2 className='font-bold'>কমপ্লিট ফ্রন্ট-এন্ড ডেভেলপমেন্ট শিখুন (জাভাস্ক্রিপ্ট)</h2>
                <p onClick={() => setExpand(!expand)} className='font-bold cursor-pointer select-none text-blue-500 underline'>{expand ? 'Collapse All' : 'Expand All'}</p>



            </div>
            {
                data.map((d) => {
                    const { id} = d;
                    return <Accordion key={id} {...d} ></Accordion>
                })
            }
        </div>



    );
};

export default Curriculum;