import React from 'react';

const Overview = () => {
    return (
        <div className='w-full p-2 min-h-max '>
            <p>কী কী শিখবেন এ কোর্স থেকে?
                একজন ফ্রন্ট-এন্ড ওয়েব ডেভেলপার হয়ে ওঠার জন্য আপনাকে একটি ওয়েবসাইট বা ওয়েব অ্যাপ্লিকেশনের ফ্রন্ট-এন্ড নিয়ে খুব ভালোভাবে জানতে হবে। তাই পুরো প্রোগ্রামে আপনি কয়েক ধাপে ফ্রন্ট-এন্ড ডেভেলপমেন্ট শেখার সুযোগ পাবেন।

                ফ্রন্ট-এন্ড ডেভেলপমেন্ট বেসিক
                এডভান্সড ফ্রন্ট-এন্ড ডেভেলপমেন্ট শেখার আগে বেসিক নিয়ে আপনার ধারণা থাকা জরুরি। তাই প্রোগ্রামের শুরুতে HTML, CSS, Bootstrap নিয়ে ধারণা পেয়ে যাবেন।

                জাভাস্ক্রিপ্ট প্রোগ্রামিং
                জাভাস্ক্রিপ্টের সাহায্যে ফ্রন্ট-এন্ড ওয়েব ডেভেলপমেন্ট শেখার আগে আপনি মডার্ন জাভাস্ক্রিপ্ট নিয়ে ধারণা পাবেন। মূলত জাভাস্ক্রিপ্টের ফ্রেমওয়ার্ক এবং লাইব্রেরীগুলো শেখার জন্য যে সলিড ফাউন্ডেশন এবং কনফিডেন্স প্রয়োজন, সেগুলো পেয়ে যাবেন এ সেকশনে।

                কমপ্লিট ফ্রন্ট এন্ড ডেভেলপমেন্ট
                ফ্রন্ট এন্ডের জন্য এ প্রোগ্রামে সবচেয়ে ডিমান্ডিং জাভাস্ক্রিপ্ট লাইব্রেরী REACT কে শিখবেন। এর সাহায্যে শক্তিশালী ও স্কেলেবল ওয়েব এপ্লিকেশন ডেভেলপ করা শিখবেন, একেবারে শূন্য থেকে। কমপ্লিট নেটিভ মোবাইল অ্যাপ ডেভেলপ করে তার সাথে ওয়েবের কোড কানেক্ট করে মাল্টিপ্ল্যাটফর্ম এপ্লিকেশন ডেভেলপমেন্ট শিখবেন।

                রিয়েল-লাইফ প্রজেক্ট
                ৭টি প্রজেক্ট আমরা কোর্সের ভিতর করে দেখাবো। কাছাকাছি ধরনের আরো ৭টি প্রজেক্ট আপনি নিজে বানিয়ে অ্যাসাইনমেন্ট হিসাবে জমা দেবেন। সে অ্যাসাইনমেন্টগুলো ইন্সট্রাকটর রিভিউ করে স্কোর করবেন আর প্রয়োজন অনুযায়ী ফীডব্যাক দিবেন।

                বিস্তারিত জানার জন্য কোর্সের সিলেবাস ও প্রজেক্ট সেকশন দেখে নিন।

                প্রোগ্রামটি কাদের জন্য?
                যারা দেশী-বিদেশী সফটওয়্যার কোম্পানি ও আইটি ফার্মগুলোতে কিংবা কোনো কোম্পানির প্রোডাক্ট ডেভেলপমেন্ট টিম জয়েন করতে চান।

                অথবা যারা বিভিন্ন অনলাইন ফ্রিল্যান্সিং মার্কেটপ্লেসে কিংবা ইন্ডিপেন্ডেন্ট টেকনিক্যাল কনসালট্যান্ট হিসাবে কাজ করতে চান।

                সম্পূর্ণ বিগিনাররাও পারবে?
                কোর্সটি বিগিনারদের জন্য। তাই কোডিং না পারলেও সমস্যা নেই। এখানে প্রয়োজনীয় কোডিং শেখানো হবে। ওয়েব ডিজাইন নিয়ে হালকা ধারণা থাকলে ভালো। তবে না থাকলেও কোনো অসুবিধা হবে না।

                আর কী কী লাগবে?
                একটি কম্পিউটার এবং ইন্টারনেট কানেকশন (ব্রডব্যান্ড হলে ভাল) দরকার হবে।</p>

        </div>
    );
};

export default Overview;