import React from 'react';

const Header = () => {
    return (
        <div>
            <div>
                <h1>সেরা ই-লার্নিং প্ল্যাটফর্ম </h1>
                <h1>  বাংলাদেশে</h1>
                <p>
                    মুক্ত কৌশলগত থিম এলাকার মাধ্যমে বৈপ্লবিক উদ্ভাবনকে স্বতন্ত্রভাবে পুনরায় সংজ্ঞায়িত
                    করুন।উচ্চ-দক্ষ আর্কিটেকচারের পরিবর্তে উচ্চ-প্রদান পরীক্ষার পদ্ধতিগুলিকে
                    ফসফ্লুরোসেন্টলি ই-সক্ষম করে।
                </p>
                  <button className='bg-[#515FCE] px-8 py-3'>শুরু করি</button>
            </div>
        </div>
    );
};

export default Header;